// --створити масив з:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль

// let numArr =[1,2,3,4,5]
// for(let num in numArr){
//     console.log(numArr[num])
// }

// let strArr =['a','b','c','d','e']
// for(let str in strArr){
//     console.log(strArr[str])
// }

// let difArr =['a', 7, true, 'bam', true]
// for(let dif in difArr){
//     console.log(difArr[dif])
// }


// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

// let arr=[]
// for(let i=0; i<=7; i++){
//     arr.push(7)
//     console.log(arr[i])
// }


// - є масив [2,17,13,6,22,31,45,66,100,-18] :

// 1. перебрати його циклом while
// let i=0
// while(i<arr.length){
    
//         console.log(arr[i])
//         i++
//     }
    
    
    // 2. перебрати його циклом for
    // for(let i=0; i<=arr.length-1; i++){
    //         console.log(arr[i])
    //     }
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// i=0
// while(i<arr.length){
//     if(i%2!==0){
//     console.log(arr[i])}
//     i++
// }

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// for(let i=0; i<=arr.length-1; i++){
//     if(i%2!==0){
//         console.log(arr[i])
//     }
// }

// 5. перебрати циклом while та вивести  числа тільки парні  значення
// i=0
// while(i<arr.length){
//     if(arr[i]%2==0){
//         console.log(arr[i])
//     }
//     i++
// }

// 6. перебрати циклом for та вивести  числа тільки парні  значення
// for(let i=0; i<=arr.length-1; i++){
//     if(arr[i]%2==0){
//         console.log(arr[i])
//     }
// }
let arr=[2,17,13,6,22,31,45,66,100,-18]
// 7. замінити кожне число кратне 3 на слово "okten"
// for(let i=0; i<=arr.length-1; i++){
//     if(arr[i]%3==0){
//         arr[i]='okten'
//     }
//     console.log(arr[i])
// }


// 8. вивести масив в зворотньому порядку.
// for(let i=arr.length-1; i>=0; i--){
//     console.log(arr[i])
// }

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// for(let i=arr.length-1; i>=0; i--){
//     if(arr[i]%3==0){
//         arr[i]='okten'
//     }
//     console.log(arr[i])
// }

// for(let i=arr.length-1; i>=0; i--){
//     if(arr[i]%2==0){
//         console.log(arr[i])
//     }
// }

let i=arr.length-1
while(i>=0){
    if(arr[i]%2==0){
        console.log(arr[i])
    }
    i--
}

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// let arr2=[1,5,7, '1','5','7', true, true, false, 'br']
// for(let i=0; i<=arr2.length-1; i++){
//     if(typeof arr2[i]==="boolean"){
//         console.log(arr2[i])
//     }
// }
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи

// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write



// стоврити масив книжок (назва, кількість сторінок, автори , жанри).
// -знайти наібльшу книжку.
// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор