// ВСЕ ЗРОБИТИ СТРІЛОЧНИМИ ФУНКЦІЯМИ!
// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
let calc1=(a,b)=>a*b
console.log(calc1(3,5))

// - створити функцію яка обчислює та повертає площу кола з радіусом r
let calc2 = r =>3.14*r**2
console.log(calc2(2))

// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
let calc3 = (h, r) => 3.14*r**2 + h*2*3.14*r
console.log(calc3(3,3))

// - створити функцію яка приймає масив та виводить кожен його елемент
// let calc4 = arr[el] => console.log(el)
let calc4 = (arr) => {
    for(let i=0; i<=arr.length-1; i++){
        console.log(arr[i])
    }
}

// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
let calc5 = text => document.write(`<p>${text}</p>`)
calc5('qwerty')

// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
let calc6 = text => document.write(`<ul><li>${text}</li><li>${text}</li><li>${text}</li></ul>`)
calc6('qwe')

// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. 
// Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
let calc7 = (string, number) => {
    document.write(`<ul>`)
    for(let i=0; i<=number-1; i++){
        document.write(`<li>${string}</li>`)
    }
    document.write(`</ul>`)
}
calc7('bananas', 5)

// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
let calc8 = (arr) =>{
    document.write(`<ul>`)
    for(let i=0; i<=arr.length-1; i++){
        document.write(`<li>${arr[i]}</li>`)
    }
    document.write(`</ul>`)
}
let arr2=[1,5,7, '1','5','7', true, true, false, 'br']
calc8(arr2)

// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. 
// Для кожного об'єкту окремий блок.

// - створити функцію яка повертає найменше число з масиву
// - створити функцію sum(arr)яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад sum([1,2,10]) //->13
// - створити функцію swap(arr,index1,index2). Функція міняє місцями заняення у відаовідних індексах
// Приклад  swap([11,22,33,44],0,1) //=> [22,11,33,44]
// - Написати функцію обміну валюти exchange(sumUAH,currencyValues,exchangeCurrency)
// Приклад exchange(10000,[{currency:'USD',value:40},{currency:'EUR',value:42}],'USD') // => 250